app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT * FROM `events`

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 2)

  def create
    @event = Event.new(params[:event])
    @event.user = current_user
    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`name`, `address`, `city`, `multi_day`, `price`, `zip`, `created_at`, `starts_at`, `updated_at`, `organizer`, `starts_on`, `venue_name`, `lng`, `user_id`, `ends_at`, `website`, `ends_on`, `description`, `sell_tickets`, `lat`, `state`, `all_day`, `number_of_tickets`) VALUES('Left Brain Right Brain Denver', '', 'Denver', 0, NULL, '', '2010-02-01 21:19:24', NULL, '2010-02-01 21:19:24', NULL, '2010-02-28', '', -104.9847034, NULL, NULL, 'http://leftbrainrightbraintour.com/', NULL, NULL, NULL, 39.7391536, 'CO', 0, NULL)

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM `events` WHERE (`events`.`id` = 4)
UPDATE `events` SET `updated_at` = '2010-02-01 21:30:20', `name` = 'Left Brain Right Brain Tour (Denver)', `lat` = 39.7391536, `lng` = -104.9847034, `description` = 'This revolutionary and ground-breaking new seminar, taught by 2 of the world’s most sought-after and beloved instructors, Ken Sklute and Mitche Graf, will show you how to “fuse” your art and business minds together to make a one dynamite package! Today’s changing economy requires a new perspective of the world, and this program will give you the skills necessary to hone your photographic art, and build your business expertise at the same time. It will rapidly enhance your evolution as a professional photographer and will teach you the finer points to creating a new business model for the 21st century.\r\nMake no mistake, there is no room or time for any fluff in this 4-hour intensive program. You will be given meat-and-potatoes information that you can use in your studio right away to become a better photographer, AND a better businessperson. This program is specifically for family, children, senior, newborn, maternity and wedding photographers.\r\nJoin Mitche and Ken for this inspiring evening of cutting-edge education, networking with fellow photographers, and a renewed sense of what’s important in your life!' WHERE `id` = 4