app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `fb_user_id`, `email_hash`, `remember_token`, `login`, `email`) VALUES('Ed Cameron', 'e0ecfed54fae814f8497df5bfa773dd54ac07cfd', '2010-01-29 17:55:58', '7a5401c4dca177045f2e3f27ca89c462dac2ef18', NULL, '2010-01-29 17:55:58', NULL, NULL, NULL, 'callmeed', 'erik.dungan@yahoo.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `fb_user_id`, `email_hash`, `remember_token`, `login`, `email`) VALUES('Erik Dungan', NULL, '2010-01-19 23:20:17', NULL, NULL, '2010-01-19 23:20:17', 506529256, NULL, NULL, 'facebooker_506529256', '')
---
  def link_user_accounts
    if self.current_user.nil?
      #register with fb
      User.create_from_fb_connect(facebook_session.user)